# day17

In [5]:
import pandas as pd

In [31]:
list1 = [ [1,2,3],[4,5,6],[7,8,9] ]

In [32]:
df = pd.DataFrame(list1, columns=["A","B","C"])

In [33]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
v=df.at[2,"C"]

In [35]:
v

9

In [37]:
df.at[2,"C"] = 10

In [38]:
df

   A  B   C
0  1  2   3
1  4  5   6
2  7  8  10

In [83]:
df2 = pd.DataFrame({"names": ["Jhon","Mery","Peter"],"age": [27, 34,47], "sex": ["male","female","female"]})

In [84]:
df2

   names  age     sex
0   Jhon   27    male
1   Mery   34  female
2  Peter   47  female

In [85]:
df2.loc[0,"age"]

27

In [86]:
df2.loc[2,"sex"] = "male"

In [87]:

df2

   names  age     sex
0   Jhon   27    male
1   Mery   34  female
2  Peter   47    male

In [104]:
df2.loc[df2["names"] == "Jhon","age"]

0    27
Name: age, dtype: int64

In [102]:
a

0    27
Name: age, dtype: int64

In [155]:
df2.loc[df2["sex"]=="female"]

   names  age     sex
1   Mery   34  female
2  Peter   47  female

In [148]:
df2

   names  age     sex
0   Jhon   27    male
1   Mery   34  female
2  Peter   47  female

In [157]:
df2.loc[df2["age"] < df2["age"].max() ,["names","age"]]

  names  age
0  Jhon   27
1  Mery   34

In [150]:

male = "male"

In [152]:
males = df2.query("sex == @male")

In [153]:
males

  names  age   sex
0  Jhon   27  male